### PREAMBLE

In [5]:
#!pip install ipython-sql
!git clone https://github.com/thomasnield/oreilly_getting_started_with_sql.git
%load_ext sql
%sql sqlite:///oreilly_getting_started_with_sql/rexon_metals.db

fatal: destination path 'oreilly_getting_started_with_sql' already exists and is not an empty directory.
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @oreilly_getting_started_with_sql/rexon_metals.db'

# JOIN
## Stitching Tables Together

Joining is the defining functionality of SQL an dsets it apart from other data technologies. 

Remember:

Normalized databases have tables with fields that point to other tables. Sonciser the CUSTOMER_ORDER table, which has a CUSTOMER_ID field.

In [7]:
%%sql
SELECT * FROM customer
LIMIT 10;

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(1, 'LITE Industrial', 'Southwest', '729 Ravine Way', 'Irving', 'TX', 75014),
 (2, 'Rex Tooling Inc', 'Southwest', '6129 Collie Blvd', 'Dallas', 'TX', 75201),
 (3, 'Re-Barre Construction', 'Southwest', '9043 Windy Dr', 'Irving', 'TX', 75032),
 (4, 'Prairie Construction', 'Southwest', '264 Long Rd', 'Moore', 'OK', 62104),
 (5, 'Marsh Lane Metal Works', 'Southeast', '9143 Marsh Ln', 'Avondale', 'LA', 79782)]

This CUSTOMER_ID field gives us a *key* to loop up in the table CUSTOMER. Knowing this, it should be no surprise that the CUSTOMER table also has a CUSTOMER_ID field. 

We can retrieve customerif information from an order from this table.

In [8]:
%%sql
SELECT * FROM customer_order
LIMIT 10;

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(1, '2015-05-15', '2015-05-18', 1, 1, 450, 'false'),
 (2, '2015-05-18', '2015-05-21', 3, 2, 600, 'false'),
 (3, '2015-05-20', '2015-05-23', 3, 5, 300, 'false'),
 (4, '2015-05-18', '2015-05-22', 5, 4, 375, 'false'),
 (5, '2015-05-17', '2015-05-20', 3, 2, 500, 'false')]

The other aspect to consider in a relationship is how many records in the child can be tited to a single record of the parent. Toake the CUSTOMER and CUSTOMER_ORDER tables and we see a *one-to-many relationship*, where a single customer record can line up with multiple orders. 

One-to-many is the most common type of relationship since it acconodates most business needs. 

## INNER JOIN

Understanding table relationships, we can consider that it might be nice to stich two tables together, so we can see CUSTOMER and CUSTOMER_ORDER information side by side. We can avoid using many lookups by using the JOIN operations.

The INNER JOIN allows us to merge two tables together. But if we are going to merge tables, we need to define a commonality between the two so records between the two line up.

In [20]:
%%sql

SELECT ORDER_ID, 
CUSTOMER.CUSTOMER_ID, 
ORDER_DATE, 
SHIP_DATE, 
NAME, 
STREET_ADDRESS, 
CITY, 
STATE, 
ZIP, PRODUCT_ID, ORDER_QTY

FROM CUSTOMER INNER JOIN CUSTOMER_ORDER
ON CUSTOMER.CUSTOMER_ID = CUSTOMER_ORDER.CUSTOMER_ID;

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(1, 1, '2015-05-15', '2015-05-18', 'LITE Industrial', '729 Ravine Way', 'Irving', 'TX', 75014, 1, 450),
 (2, 3, '2015-05-18', '2015-05-21', 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, 2, 600),
 (3, 3, '2015-05-20', '2015-05-23', 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, 5, 300),
 (4, 5, '2015-05-18', '2015-05-22', 'Marsh Lane Metal Works', '9143 Marsh Ln', 'Avondale', 'LA', 79782, 4, 375),
 (5, 3, '2015-05-17', '2015-05-20', 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, 2, 500)]

1. Select the fields we want from the CUSTOMER and CUSTOMER_ORDER tables.

1. The important part that temorarily merges two tables into one.

## LEFT JOIN

Two customers were excluded from the INNER JOIN on CUSTOMER_ID since they didn't have any orders to join on. But suppose we wanted them included anyways. 

Modify the previous query to utilize the LEFT JOIN:

In [21]:
%%sql

SELECT ORDER_ID, 
CUSTOMER.CUSTOMER_ID, 
ORDER_DATE, 
SHIP_DATE, 
NAME, 
STREET_ADDRESS, 
CITY, 
STATE, 
ZIP, PRODUCT_ID, ORDER_QTY

FROM CUSTOMER LEFT JOIN CUSTOMER_ORDER
ON CUSTOMER.CUSTOMER_ID = CUSTOMER_ORDER.CUSTOMER_ID;

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(1, 1, '2015-05-15', '2015-05-18', 'LITE Industrial', '729 Ravine Way', 'Irving', 'TX', 75014, 1, 450),
 (None, 2, None, None, 'Rex Tooling Inc', '6129 Collie Blvd', 'Dallas', 'TX', 75201, None, None),
 (5, 3, '2015-05-17', '2015-05-20', 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, 2, 500),
 (2, 3, '2015-05-18', '2015-05-21', 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, 2, 600),
 (3, 3, '2015-05-20', '2015-05-23', 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, 5, 300),
 (None, 4, None, None, 'Prairie Construction', '264 Long Rd', 'Moore', 'OK', 62104, None, None),
 (4, 5, '2015-05-18', '2015-05-22', 'Marsh Lane Metal Works', '9143 Marsh Ln', 'Avondale', 'LA', 79782, 4, 375)]

The table specifiedon the "left" side of the LEFT JOIN operator will have all its records included, even if they do not have any child records in the "right" table. Notice we have two additional records for the customers that have no orders.

It is common to use LEFT JOIN to find "orphaned" child records.

In [13]:
%%sql

SELECT 
CUSTOMER.CUSTOMER_ID,
NAME as CUSTOMER_NAME
FROM CUSTOMER LEFT JOIN CUSTOMER_ORDER
ON CUSTOMER.CUSTOMER_ID = CUSTOMER_ORDER.CUSTOMER_ID
WHERE ORDER_ID IS NULL;

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(2, 'Rex Tooling Inc'), (4, 'Prairie Construction')]

## Joining Mutliple Tables

Relationsal databses can be complex in terms of relationships between tables.

For example, we can supply not only CUSTOMER information to the CUSTOMER_ORDER table, but also PRODUCT information using PRODUCT_ID.

We can use these relationships to execute a query that displays orders with customer information and product information simultaneously. All we do is define the two joins.

In [19]:
%%sql

SELECT
ORDER_ID,
CUSTOMER.CUSTOMER_ID,
NAME as CUSTOMER_NAME,
STREET_ADDRESS,
CITY,
STATE,
ZIP,
ORDER_DATE,
PRODUCT.PRODUCT_ID,
DESCRIPTION,
ORDER_QTY,
ORDER_QTY * PRICE as REVENUE

FROM CUSTOMER
INNER JOIN CUSTOMER_ORDER 
ON CUSTOMER.CUSTOMER_ID = CUSTOMER_ORDER.CUSTOMER_ID

INNER JOIN PRODUCT
ON CUSTOMER_ORDER.PRODUCT_ID = PRODUCT.PRODUCT_ID

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(1, 1, 'LITE Industrial', '729 Ravine Way', 'Irving', 'TX', 75014, '2015-05-15', 1, 'Copper', 450, 3379.5),
 (2, 3, 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, '2015-05-18', 2, 'Aluminum', 600, 1548.0),
 (3, 3, 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, '2015-05-20', 5, 'Bronze', 300, 1200),
 (4, 5, 'Marsh Lane Metal Works', '9143 Marsh Ln', 'Avondale', 'LA', 79782, '2015-05-18', 4, 'Steel', 375, 4616.25),
 (5, 3, 'Re-Barre Construction', '9043 Windy Dr', 'Irving', 'TX', 75032, '2015-05-17', 2, 'Aluminum', 500, 1290.0)]

## Grouping JOINs

We have orders with their revenue, thatnks to the join we built. But suppose we want to find the total_revenue by customer? We still need to use all three tables and merge them together with out current join setup, since we need the revenue we just calculated. But also we need to do a GROUP BY:

In [23]:
%%sql

SELECT CUSTOMER.CUSTOMER_ID,
NAME as CUSTOMER_NAME,
sum(ORDER_QTY * PRICE) as TOTAL_REVENUE

FROM CUSTOMER_ORDER

INNER JOIN CUSTOMER
ON CUSTOMER.CUSTOMER_ID = CUSTOMER_ORDER.CUSTOMER_ID 

INNER JOIN PRODUCT
ON CUSTOMER_ORDER.PRODUCT_ID = PRODUCT.PRODUCT_ID

GROUP BY 1, 2

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(1, 'LITE Industrial', 3379.5),
 (3, 'Re-Barre Construction', 4038.0),
 (5, 'Marsh Lane Metal Works', 4616.25)]

Since we want all customers we can use LEFT JOIN in place of INNER JOIN

In [26]:
%%sql

SELECT CUSTOMER.CUSTOMER_ID,
NAME as CUSTOMER_NAME,
coalesce(sum(ORDER_QTY * PRICE),0) as TOTAL_REVENUE

FROM CUSTOMER_ORDER

LEFT JOIN CUSTOMER
ON CUSTOMER.CUSTOMER_ID = CUSTOMER_ORDER.CUSTOMER_ID 

LEFT JOIN PRODUCT
ON CUSTOMER_ORDER.PRODUCT_ID = PRODUCT.PRODUCT_ID

GROUP BY 1, 2

   sqlite:///oreilly_getting_started_with_sql/rexon.db
 * sqlite:///oreilly_getting_started_with_sql/rexon_metals.db
   sqlite:///oreilly_getting_started_with_sql/weather_stations.db
Done.

[(1, 'LITE Industrial', 3379.5),
 (3, 'Re-Barre Construction', 4038.0),
 (5, 'Marsh Lane Metal Works', 4616.25)]